{"id":69,"date":"2023-04-07T11:14:00","date_gmt":"2023-04-07T11:14:00","guid":{"rendered":"http:\/\/localhost\/cpnft\/?page_id=69"},"modified":"2023-04-07T12:26:00","modified_gmt":"2023-04-07T12:26:00","slug":"the-story","status":"publish","type":"page","link":"http:\/\/localhost\/cpnft\/the-story\/","title":{"rendered":"the story&#8230;"},"content":{"rendered":"\n<p>The story of Camera Person NFT begins with a vision to unite photographers from around the world through the power of blockchain technology. This unique project is built on the Ethereum blockchain, and its aim is to create a community of photography enthusiasts and professionals who collaborate on large-scale photography collections. By combining the excitement of collectible profile picture projects with the artistic beauty of photography, Camera Person NFT establishes a new creative frontier in the NFT space.<br><\/p>\n\n\n\n<p>At the heart of Camera Person NFT is the Community Photography Collection, an innovative concept that invites NFT holders to participate in collaborative photography projects. By owning a Camera Person NFT, participants gain the right to submit one photograph for each community collection. All proceeds from these collections are then distributed entirely to the artists responsible for the work.<br><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>To ensure a fair and inclusive environment, Camera Person NFT allows only one submission per creator, while those who own multiple NFTs can register additional creators and their wallets to contribute. The project&#8217;s dedicated dApp, cameraperson.xyz, streamlines the submission process, enabling creators to register, provide descriptions, and assign specific traits to their photographs.<br><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>The first Community Photography Collection, a testament to the project&#8217;s vision, culminated in an impressive body of work consisting of 122 photographs from 122 artists across 39 countries. The collection started accepting submissions on June 6th, 2022, and began minting on June 20th, 2022. Each piece was priced at 0.05 ETH, and the funds generated are allocated entirely to the artists. Although the majority of the first collection has been minted, the project is still in the process of minting the remaining pieces.<br><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p>Camera Person NFT represents a remarkable experiment in the NFT landscape, offering photographers an unparalleled opportunity to showcase their work and engage with a global community. As the first project of its kind, it paves the way for future collaborative endeavors in the ever-evolving world of NFTs.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The story of Camera Person NFT begins with a vision to unite photographers from around the world through the power of blockchain technology. This unique project is built on the Ethereum blockchain, and its aim is to create a community of photography enthusiasts and professionals who collaborate on large-scale photography collections. By combining the excitement [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"http:\/\/localhost\/cpnft\/wp-json\/wp\/v2\/pages\/69"}],"collection":[{"href":"http:\/\/localhost\/cpnft\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/localhost\/cpnft\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/cpnft\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/cpnft\/wp-json\/wp\/v2\/comments?post=69"}],"version-history":[{"count":4,"href":"http:\/\/localhost\/cpnft\/wp-json\/wp\/v2\/pages\/69\/revisions"}],"predecessor-version":[{"id":112,"href":"http:\/\/localhost\/cpnft\/wp-json\/wp\/v2\/pages\/69\/revisions\/112"}],"wp:attachment":[{"href":"http:\/\/localhost\/cpnft\/wp-json\/wp\/v2\/media?parent=69"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}